In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [2]:
#import MYSQL database
pymysql.install_as_MySQLdb()
connection = "mysql+pymysql://root:root@localhost/sakila"
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

![png](sakila-db-model.png)

1. What query would you run to get all the customers inside city_id = 312?</br>  Your query should return the customers' first name, last name, email, address, and city.

In [3]:
q = """SELECT
  cus.first_name,
  cus.last_name,
  cus.email,
  cus.address_id,
  cit.city_id
FROM
  customer AS cus
  INNER JOIN city as cit ON cus.address_id = cit.city_id
Where
  cit.city_id =312;

"""
pd.read_sql(q, engine)

  first_name last_name                          email  address_id  city_id
0     JOSEPH       JOY  JOSEPH.JOY@sakilacustomer.org         312      312

2. What query would you run to get all comedy films?</br> Note that the genre is called the category in this schema.</br> Your query should return film title, description, release year, rating, and special features.

In [ ]:
q = """SELECT
   f.title, 
   f.description, 
   f.release_year, 
   f.rating, 
   f.special_features,
   c.name
FROM
  film AS f
  INNER JOIN category as c ON f.film_id = c.category_id
WHere c.name = "comedy";

"""
pd.read_sql(q, engine)

3. What query would you run to get all the films that Johnny Lollobrigida was in?</br> Your query should return the actor's last name, film title, and release year.

In [14]:
q = """SELECT
   f.title, 
   f.description, 
   a.last_name
FROM
  film AS f
  INNER JOIN actor as a ON f.film_id = a.actor_id
WHere a.last_name = "Lollobrigida";

"""
pd.read_sql(q, engine)

,title,description,last_name
0,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,LOLLOBRIGIDA

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [15]:
q = """SELECT
   f.title, 
   a.last_name,
   a.first_name
FROM
  film AS f
  INNER JOIN actor as a ON f.film_id = a.actor_id
WHere f.title = "Bingo Talented";

"""
pd.read_sql(q, engine)

            title last_name first_name
0  BINGO TALENTED      PENN       GARY

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount?

In [20]:
q = """SELECT
    amount
FROM payment 
WHERE amount > (SELECT AVG(amount)*2 FROM payment);
"""
pd.read_sql(q, engine)

     amount
0      9.99
1     10.99
2      8.99
3     10.99
4      8.99
..      ...
852    9.99
853   10.99
854    8.99
855    9.99
856    8.99

[857 rows x 1 columns]

What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments?</br> You can title the number of payments as num_payments.

In [31]:
q = """SELECT 
    c.first_name,
    c.last_name,
    COUNT(p.payment_id)  as num_payments
FROM customer as c
  INNER JOIN payment as p ON c.customer_id= p.customer_id
GROUP BY p.customer_id
ORDER BY num_payments DESC
LIMIT 5 ;
"""
pd.read_sql(q, engine)

  first_name last_name  num_payments
0    ELEANOR      HUNT            46
1       KARL      SEAL            45
2     MARCIA      DEAN            42
3      CLARA      SHAW            42
4      TAMMY   SANDERS            41